package  table
{
	/**
	 * ...
	 * @author AZARASHI
	 */
	public class BlockPlaceTable 
	{
		// Y座標の後にX座標を走査させることでブロック位置を求められます。
		public static var tabel:Object = {
			//一行目
			100: {
					//ブロック位置0
					5:0,
					//ブロック位置1
					136:1,
					//ブロック位置2
					267:2,
					//ブロック位置3
					398:3
				 },
			//二行目
			231: {
					//ブロック位置4
					5:0,
					//ブロック位置5
					136:1,
					//ブロック位置6
					267:2,
					//ブロック位置7
					398:3
				 },
			//三行目
			362: {
					//ブロック位置8
					5:0,
					//ブロック位置9
					136:1,
					//ブロック位置10
					267:2,
					//ブロック位置11
					398:3
				 },
			//四行目
			493: {
					//ブロック位置12
					5:0,
					//ブロック位置13
					136:1,
					//ブロック位置14
					267:2,
					//ブロック位置15
					398:3
				 }
		};
		
		
		public function BlockPlaceTable() 
		{}
		
	}

}